//===========================================================================
//文件名称：isr.h（中断底层驱动构件头文件）
//功能概要： 声明用户ISR
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2012-11-12   V1.0
//===========================================================================

#ifndef ISR_H_
#define ISR_H_

// 注册自定义中断服务例程

//===========================================================================
//函数名称：isr_uart0_re
//参数说明：user_isr_ptr：用户自定义参数
//功能概要：UART_0(串口0)中断服务例程
//===========================================================================
void isr_uart0_re(pointer user_isr_ptr);

//===========================================================================
//ISR 名称：gpio_CD_ISR中断服务例程
//功能概要：gpio 中断例程，判断DIO0、DIO1、DIO4产生的中断
//===========================================================================
void gpio_CD_ISR(pointer user_isr_ptr);

//===========================================================================
//函数名称：isr_pit
//参数说明：user_isr_ptr：用户自定义参数
//功能概要：PIT中断服务例程，用于记录开机运行时间
//===========================================================================
void isr_pit(pointer user_isr_ptr);


#endif
