//===========================================================================
//文件名称：flash.h
//功能概要：flash底层驱动构件头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版    本：V3.0(WYH),20140909
//===========================================================================

#ifndef _FLASH_H
#define _FLASH_H

#include "common.h"
#define SIZE_FLASHPAGE 1024
//==========================================================================
//函数名称：flash_init
//函数返回：无
//参数说明：无
//功能概要：flash初始化
//==========================================================================
void flash_init();

//==========================================================================
//函数名称：flash_erase
//函数返回：函数执行执行状态：0=正常；非0=异常。
//参数说明：sectorNo：目标扇区号(0~127)
//功能概要：擦除指定flash扇区
//==========================================================================
uint_8 flash_erase(uint_16 sectNo);

//==========================================================================
//函数名称：flash_write
//函数返回：函数执行状态：0=正常；非0=异常。
//参数说明：sectNo：目标扇区号(0~127)
//         offset：写入扇区内部偏移地址（0~1023）
//         cnt：写入字节数目（1~1024）
//         buf：源数据缓冲区首地址
//功能概要：flash写入操作
//==========================================================================
uint_8 flash_write(uint_16 sectNo,uint_16 offset,uint_16 cnt,uint_8 buf[]);

//============================================================================
//函数名: flash_read
//函数返回：函数执行状态：0=正常；非0=异常。
//参数说明：sectNo：目标扇区号(0~127)
//         offset：读取扇区内部偏移地址（0~1023）
//         cnt：读取字节数目（1~1024）
//         offset+cnt<=1024
//         buf：读取数据缓冲区首地址
//功能概要：flash读取指定扇区操作
//============================================================================
void flash_read(uint_16 sectNo,uint_16 offset,uint_16 cnt,uint_8 buf[]);

//==========================================================================
//函数名称：flash_secure
//函数返回：函数执行状态：0=正常；非0=异常。
//参数说明：无
//功能概要：flash加密操作
//==========================================================================
uint_8 flash_secure(uint_8 key[]);

//==========================================================================
//函数名称：flash_unsecure
//函数返回：函数执行状态：0=正常；非0=异常。
//参数说明：无
//功能概要：flash解密操作
//==========================================================================
uint_8 flash_unsecure();

//==========================================================================
//函数名称：flash_protect
//函数返回：无
//参数说明：无
//功能概要：flash保护操作
//==========================================================================
void flash_protect();

//==========================================================================
#endif //_FLASH_H
