//
//  address_manage.h
//  Register
//
//  Created by Nero Zuo on 17/4/26.
//  Copyright Nero. All rights reserved.
//

#ifndef address_manage_h
#define address_manage_h


#include "common.h"    


#define REG_COUNT 10
//=====================================================================
//函数名称：init_addr_info
//函数返回：无
//参数说明：无
//功能概要：初始化地址
//=====================================================================
void init_addr_info();

//=====================================================================
//函数名称：regisger
//函数返回：注册得到的地址
//参数说明：无
//功能概要：注册一个地址，返回注册的地址
//=====================================================================
uint_8 regisger();

//=====================================================================
//函数名称：updateTTL
//函数返回：无
//参数说明：无
//功能概要：更新各个地址的 Time To Live 值
//=====================================================================
void updateTTL();

//=====================================================================
//函数名称：receive_heartbeat_from
//函数返回：无
//参数说明：addr: 获得来自 addr 的心跳包
//功能概要：获取来自 addr 的心跳包然后更新 TTL
//=====================================================================
void receive_heartbeat_from(uint_8 addr);

//=====================================================================
//函数名称：receive_key_from
//函数返回：无
//参数说明：addr: 源节点的地址
//         key: addr 的密钥
//功能概要：获取来自 addr 的密钥
//=====================================================================
void receive_key_from(uint_8 addr, uint_8 key);

//=====================================================================
//函数名称：alive_node_addrs
//函数返回：存活的节点个数
//参数说明：aliveAddrs: 传入一个 array，函数执行后，会将活着的地址放到改数组中
//功能概要：获得所有活着的节点
//=====================================================================
uint_8 alive_node_addrs(uint_8* aliveAddrs);

#endif /* address_manage_h */
