//===========================================================================
//文件名称：adc.h
//功能概要：ADC底层驱动构件头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版    本：V3.0(WYH),20140909
//备    注：SD-FSL-KW01节点中共有11路单端外部AD采集通道，2对差分外部AD采集通道，4路
//     内部AD采集通道（包括芯片内部温度采集通道），具体通道对应如下表所示：
//                     SD-FSL-KW01节点ADC通道输入表
//通道号	                    单端输入	                 引脚名               差分输入	                                     引脚名
//00001(1)      ADC0_SE1	   PTE16     ADC0_DP1和ADC0_DM1    PTE16和PTE17
//00010(2)	    ADC0_SE2	   PTE18     ADC0_DP2和ADC0_DM2	   PTE18和PTE19
//00101(5)      ADC0_SE5a	   PTE17              保留
//00110(6)	    ADC0_SE6a	   PTE19              保留
//00110(6)	    ADC0_SE6b	   PTD5	              保留
//00111(7)	    ADC0_SE7b	   PTD6                 保留
//01000(8)	    ADC0_SE8	   PTB0	               保留
//01001(9)	    ADC0_SE9	   PTB1                 保留
//01011(11)	    ADC0_SE11	   PTC2                 保留
//01100(12)	    ADC0_SE12	   PTB2	               保留
//01111(15)	    ADC0_SE15	   PTC1	               保留
//11010(26)     Temp Sensor               Temp Sensor
//11011(27)     Bandgap                   Bandgap
//11101(29)	    V(REFSH)                  -V(REFSH)
//11110(30)     V(REFSL)                  保留
//上表中所有引脚的ADC功能复用编号都为【默认、0】
//20141019测试结果：单端可以，差分效果等同于单端，ADC0_SE6b、ADC0_SE7b数据怪异，不可用；
//ADC0_SE6b效果等同于ADC0_SE6a
//===========================================================================

#ifndef _ADC_H
#define _ADC_H

#include "common.h"    //包含公共要素头文件

//用于定义采样次数
#define SAMPLE4   0
#define SAMPLE8   1
#define SAMPLE16  2
#define SAMPLE32  3
//定义输入模式
#define SINGLE_END     0   //单端输入
#define DIFFERENTIAL   1   //差分输入

//============================================================================
//函数名称： adc_init
//功能概要： 初始化adc模块
//参数说明： diff配置模式: 单端输入SINGLE_END
//                    差分输入DIFFERENTIAL
//        accurary采样精度:单端8-12-10-16；差分9-13-11-16
//        HardwareAverage硬件滤波：SAMPLE4/SAMPLE8/SAMPLE16/SAMPLE32
//============================================================================
void adc_init(uint_8 diff,uint_8 accurary,uint_8 HardwareAverage);
//============================================================================
//函数名称： adc_init_b
//功能概要： 初始化adc模块,选择B通道
//参数说明： diff配置模式: 单端输入SINGLE_END
//                    差分输入DIFFERENTIAL
//        accurary采样精度:单端8-12-10-16；差分9-13-11-16
//        HardwareAverage硬件滤波：SAMPLE4/SAMPLE8/SAMPLE16/SAMPLE32
//============================================================================
void adc_init_b(uint_8 diff,uint_8 accurary,uint_8 HardwareAverage);
//============================================================================
//函数名称：adc_read
//功能概要：初始化adc模块                                                
//参数说明：channel：单端输入 通道范围 0~ 23，差分输入通道范围 1~ 2
//                  具体可使用的通道号请见adc.h头部的说明
//============================================================================
uint_16 adc_read(uint_8 channel);

//============================================================================
//函数名称：adc_cal
//功能概要：adc模块校正功能函数
//注       意：在校正之前，须正确配置ADC时钟、采样时间、模式、硬件滤波32次
//============================================================================
uint_8 adc_cal();

#endif
