//==========================================================================
//文件名称：pit.h
//功能概要：pit底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//版    本：V3.0(WYH),20140909
//备注：PIT使用总线时钟(24MHz)
//==========================================================================

#ifndef _PIT_H
#define _PIT_H

//1 包含头文件
#include "common.h"

//2 宏定义
#define PIT_IRQ_NO 22
#define PIT0 0
#define PIT1 1

//==========================================================================
//函数名称: pit_init                                                         
//函数返回: 无                                          
//参数说明: pitno:表示pit通道号，PIT0、PIT1。
//          int_us:表示定时器运行的周期，单位微秒.一般取5ms.即5000 
//功能概要: 设置相关寄存器的值       
//==========================================================================
void pit_init(uint_8 pitno,uint_32 int_us);

//==========================================================================
//函数名称: pit_enable_int
//函数返回: 无                                              
//参数说明: pitno--PIT内部定时器编号
//功能概要: 开PIT中断                                                                                                
//==========================================================================
void pit_enable_int(uint_8 pitno);

//==========================================================================
//函数名称: pit_disable_int
//函数返回: 无                                              
//参数说明: pitno--PIT内部定时器编号
//功能概要: 关闭PIT中断       
//==========================================================================
void pit_disable_int(uint_8 pitno);

//==========================================================================
//函数名称: pit_isr_time                                                    
//函数返回: 无                                              
//参数说明: 无   
//功能概要: 重置pit中断时间                                                                                                
//==========================================================================
void pit_isr_time(uint_8 pitno,uint_32 int_us);

#endif
